## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-terraform-azure-demo"
    }

  # azurerm_resource_group.rg-aks will be destroyed
  # (because azurerm_resource_group.rg-aks is not in configuration)
  - resource "azurerm_resource_group" "rg-aks" {
      - id       = "/subscriptions/e97932fb-27a0-4b77-9e88-816d9a93bc60/resourceGroups/rg-terraform-azure-demo" -> null
      - location = "eastus" -> null
      - name     = "rg-terraform-azure-demo" -> null
      - tags     = {} -> null
    }

  # module.snet_hub_001_default.azurerm_network_security_group.snet_nsg[0] will be created
  + resource "azurerm_network_security_group" "snet_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-vnet-hub-eastus-001-snet-default"
      + resource_group_name = "rg-terraform-azure-demo"
      + security_rule       = (known after apply)
    }

  # module.snet_hub_001_default.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.2.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-default"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-terraform-azure-demo"
      + virtual_network_name                           = "vnet-hub-eastus-001"
    }

  # module.snet_hub_001_default.azurerm_subnet_network_security_group_association.nsg_association[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet_hub_001.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.2.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-hub-eastus-001"
      + resource_group_name = "rg-terraform-azure-demo"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.
```
</details>